const URL_PREFIX = "http://127.0.0.1:5000";
const themeColors = ['#dac00a', '#FDD835', '#ef6c00', '#0adad0', '#26a69a', '#064cd6', '#42a5f5', '#7705d5', '#e040fb', '#ff1744'];
const themeNames = ['贷款套现', '股票金融', '兼职', '广告', '房地产', '犯罪服务', '违法服务', '冒充银行', '冒充运营商',  '恶意骚扰']
const clusterNames = ['急用钱', '广告', '非法服务', '钓鱼诈骗', '恶意骚扰'];
const subThemeIndexes = [0, 0, 0, 1, 1, 2, 2, 3, 3, 4]
const themeIndexes = [5, 7, 7, 7, 0, 2, 1, 8, 6, 0, 7, 8, 5, 3, 6, 4, 9, 6];
const clusterIndexes = [[[5, 10], [7], [6]], [[14], [16]], [[1, 13], [9, 15, 18]], [[2, 3, 4, 11], [8, 12]], [[17]]];
// const clusterIndexes = [[0,1,2],[3,4],[5,6],[7,8],[9]];
// const messageThemes = [
//     {
//         'themeName': '急用钱',
//         'subThemes': {
//             '贷款套现': [5, 10],
//             '股票金融': [7],
//             '兼职': [6]
//         }
//     },
//     {
//         'themeName': '广告',
//         'subThemes': {
//             '广告': [14],
//             '房地产': [16]
//         }
//     },
//     {
//         'themeName': '非法服务',
//         'subThemes': {
//             '犯罪服务': [1, 13],
//             '违法服务': [9, 15, 18]
//         }
//     },
//     {
//         'themeName': '钓鱼诈骗',
//         'subThemes': {
//             '冒充银行': [2, 3, 4, 11],
//             '冒充运营商': [8, 12]
//         }
//     },
//     {
//         'themeName': '恶意骚扰',
//         'subThemes': {
//             '恶意骚扰': [17]
//         }
//     }
// ];
